{
  "episodes": [
    {
      "id": "e2c6aca5b343",
      "date": "2026-01-29",
      "title": "Clawdbot Is Now Moltbot",
      "summary": "Meta 財報佳，市場看好 AI 投資。Microsoft 財報差，Azure 雲端成長放緩。Tesla 全面轉向機器人和 AI。Dow 化學公司 AI 裁員。Waymo 自駕車事故調查。Moltbot 安全疑慮。",
      "content": " Welcome back to Fandoole Casino's Thrill Talk. Let's see who's getting rewarded on Rewards Club. Everyone, check your rewards out. I've got a reward box. You get a reward? You get a reward. I've got a birthday bonus. I've got a birthday bonus. Everybody gets a reward. Fandoole Casino Rewards Club. Rewards for all, starting day one. 21 plus in present select states, bonus issue is non with trouble. Casino's like Friday, Friday, Friday, Friday, Friday, Saturday, Saturday, Fandoole Casino. A problem called 1-800-AMBLER! Welcome to the Techbury Ride Humb for Thursday, January 29th, 2026. I'm Brian McCullard, today. MetaEarningsGood, the streets likes the AI spending. Microsoft earnings bad, why is deeply growth in their cloud business, not as robust all of the sudden? Elon is following through on taking Tesla all in on robots, and AI, the AI-inspired layoffs are not just for the tech industry anymore And are you actually technical enough to run that Claude bot? Here's what you missed today in the world of tech. Everyone seems to be deploying AI agents right now, but the thing is, sometimes AI agents mess up. They go off script or make changes you didn't authorize forcing you to diagnose and fix it. The good news is, Rubrik Agent Cloud helps prevent that extra work. It's the only platform that allows you to monitor, govern, and rewind AI agent actions. It's like an undo button for AI. It runs in the background the whole time and makes sure things stay on track. On a singular platform, Rubrik helps you unleash more agents faster while mitigating risk. So if you're running AI agents and want to rest a little easier at night, check it out. Right now, my listeners, get exclusive early access to Rubrik Agent Cloud, head to rubrik.com. That's rubrik.com. I'm going to run down a bunch of earnings news here all in one segment, starting with Meta, who reported earnings yesterday that were fine. Meta stock is up nearly 8% this morning, and that comes even as Meta said, it expects its 2020 CapEx spend to be $115 to $135 billion. That compares to a $110.6 billion analyst estimate and the $72.2 billion it spent on CapEx just last year. This is all, of course, driven by investments in their super intelligence labs. And quoting TechCrunch, in 2025, we rebuilt the foundations of our AI program. Mark Zuckerberg said on an investor call, Wednesday referring to the company's recently Restructured AI Lab. Over the coming months, we're going to start shipping our new models and products, and I expect us to steadily push the frontier over the course of the new year, end quote. But while Zuckerberg didn't give specific timelines or products, he highlighted AI-driven commerce as a particular area of focus for Meta. This also has implications for commerce. Zuckerberg continued, new agent shopping tools will allow people to find just the right set of products from the businesses in our catalog. That proposal echoes broader interest in AI-powered shopping assistance across the industry. Both Google and OpenAI have built platforms for agent-enabled transactions with companies like Stripe and Uber signed on as partners. But while other AI labs have already built significant technical infrastructure, Meta believes its access to personal data will prove uniquely valuable. We're starting to see the promise of AI that understands our personal context, including our history, our interests, our content, and our relationships. Zuckerberg said on the call, a lot of what makes agents valuable is the unique context that they can see, and we believe that Meta will be able to provide a uniquely personal experience, end quote. So that was Meta. Good. The street seems to buy into that AI narrative and our sanguine about continued spending. To get there, I guess, but conversely, Microsoft and not good. Down almost 12% this morning, 12% in one day is pretty, pretty, not good, right? So what's up here? Quoting CNBC. The software maker showed slowing growth in its Azure Cloud segment, which declined to 39% growth from 40% growth in the company's first fiscal quarter. Investors closely watch the segment as a stand-in for measuring enterprise AI demand. At the same time, capital expenditures and finance leases in the quarter jumped 66% to 37.5 billion, surpassing the 34.31 billion expected by analysts pulled by visible alpha as the company supports demand for its cloud and AI segments. The company also said it's struggling with compute capacity constraints as demands continue to outweigh supply. Microsoft finance chief Amy Hood said Azure would have ground 40% if the company had funneled all of its new GPU chips in the first and second quarter into its Azure business end quote. Microsoft also said its cloud contracted backlog grew 110% to $625 billion, around 45% of which comes from open AI alone. So that's basically money that should come in to Microsoft someday in theory if no bubbles burst. Also, I wanna note a third company, SK Heenix, has surpassed Samsung and annual operating profit for the very first time. SK Heenix posted a record profit of around $33 billion. In 2025, while Samsung posted $30.5 billion the reason here, well, they can't sell those memory chips fast enough again, AI. . Bunch of Tesla news this morning, Tesla plans to scrap its premium S and X models and convert its California factory into an Optimus manufacturing hub, as Elon Musk refocuses the company on Robotics and AI, quoting the FT Tesla plans to scrap two models and invest $2 billion in Elon Musk's XAI, as the electric vehicle pioneer accelerates a charge into robotics and artificial intelligence, following its first drop in annual revenue. In the clearest sign yet of where Musk is steering Tesla, the company said it would end production of the premium S&X models next quarter and convert its California factory into a manufacturing hub for its Optimus robots. The announcements came as Tesla's fourth quarter results laid bear the damage to the car maker from a year dominated by the Trump administration's ending of EV tax incentives, Musk's polarizing politics, and the continued rise of low-cost Chinese rival BYD. Announcing the decision to ditch the premium S&X models, Musk said that it is slightly sad, but it's part of our overall shift to an autonomous future. The world's richest man has gambled Tesla's future on self-driving cybercabs and AI-enabled humanoid robots. The group has begun calling itself a physical AI company. Tesla has also pressed ahead with a $2 billion investment in Musk's XAI as part of its January funding round, despite Luke Worm's shareholders' support for that move. SpaceX, the billionaire's rocket company, has already invested $2 billion in XAI as he seeks more financial support for the capital-intensive business. The move to link Tesla more closely to Musk's AI group came after a non-binding shareholder resolution in November pushed for such an investment. While the measure received more votes in favor than against the combined number of abstentions, and no votes showed a majority of shareholders were not behind the move. Maybe it's not just tech companies? Dow! Chemical Maker Dow says it plans to cut 4,500 staff to save costs and will rely on AI to boost productivity, resulting in 1.1 to 1.5 billion dollars in charges. Dow currently employs around 34,000 people. Quoting the journal, Dow said it is embarking on a program dubbed Transform to Outperform, which would employ artificial intelligence and automation to reduce expenditure and catalyze growth and productivity, yielding an additional $2 billion in operating earnings before interest depreciation and immortalization. Chairman and CEO Jim Thetterling said the program represents a comprehensive and radical simplification of our operating model. The company currently employs about 34,000 people and operates sites in 29 countries. Dow anticipates several charges and other costs associated with the program, including $600 to $800 million in seven's costs and $500 to $700 million in other one-time costs. In 2027, Dow said the overhaul would result in 1.2 billion dollars in incremental operating EBITDA with charges of about $300 to $500 million. In 2028, the program would add $300 million in operating EBITDA with no further charges. Waymo says one of its robotaxies struck a child at six miles per hour near an elementary school in Santa Monica on January 23rd, resulting in minor injuries. Quoting tech crunch, the NHTSA has opened an investigation into the accident and Waymo said in a blog post that it will cooperate fully with them throughout the process. Waymo said its robotaxies struck the child at six miles per hour after breaking hard from around 17 miles per hour. The young pedestrian quote suddenly entered the roadway from behind a tall SUV moving directly into our vehicle's path. The company said in its blog post, Waymo said its vehicle immediately detected the individual as soon as they began to emerge from behind the stopped vehicle. Following contact, the pedestrian stood up immediately, walked to the sidewalk, and we called 911. The vehicle remained stopped, moved to the side of the road, and stayed there until law enforcement cleared the vehicle to leave the scene, Waymo wrote in the post. News of the crash comes as Waymo faces dual investigations into its robotaxies illegally passing school buses. The NHTSA opened a probe into the problem in October shortly after the first report of the incident in Atlanta, Georgia, and the National Transportation Safety Board opened its own investigation last week after around 20 incidents were reported in Austin, Texas. According to the NHTSA, the accident occurred within two blocks of the elementary school during normal school drop-off hours. The safety regulator said there were other children, a crossing guard, and several double parked vehicles in the vicinity. The NHTSA's Office of Defects investigation is investigating whether the Waymo AV exercised appropriate caution given among other things its proximity to the elementary school during drop-off hours, and the presence of young pedestrians and other potential vulnerable road users. Picture this, you've been chosen to lead AI onboarding for your team. That includes everyone from season to technical pros to AI newcomers. No pressure, right? It's where area comes in. Areas, no code, low code, and pro-code platform makes it easy for your organization to embrace AI regardless of technical experience. With areas unified security layer, advanced threat detection, and robust compliance measures, your AI ecosystem can stay safe while your team innovates. Worried about staying on budget? Areas cost optimization tools can help you manage and forecast your AI spend, so there are no surprises. It started at area.com slash morning brew. That's area.com slash morning brew. With everything you balance at work, wouldn't it be nice to have your own personal chief of staff, something that can capture meetings, calls, in-person and online conversations without forcing anyone to use their phone or break eye contact? Well, that's exactly what PLAWD is. A dedicated AI note-taking device designed to capture in-person conversations so you can stay in the moment. Plot devices are small, secure, and can automatically deliver accurate transcripts, clear summaries with action items right in your phone and with over 20 hours of continuous recording. You can be more present without losing key details or phone battery life. For a limited time, you can get 10% off any plot device when you check out with code TBRH. Visit plot.ai slash TBRH to learn more. USPLAUD.AI slash TBRH code TBRH. US-based AI startup Acre has released Trinity Large, a 400-billion-parameter open-weight model that it says compares to Metaslamah 4 Maverick 400B on some benchmarks. I'm flagging this because look, it's not just the Chinese. We can make impressive open-weight models right here in the good old US of A. Quoting tech crunch. Many in the industry think the winners of the AI model market have already been decided. Big tech will own it. Google, Meta, Microsoft, a bit of Amazon, along with their model makers of choice, largely open AI and anthropic. But tiny 30-person startup Acre AI disagrees. The company just released a truly and permanently open Apache license general purpose foundation model called Trinity and Acre claims that at 400-billion parameters, it is among the largest open source foundation models ever trained and released by a US company. Acre says Trinity compares to Metaslamah 4 Maverick 400B and Zai's GLM 4.5, a high performance open source model from China's Tashinga University, according to benchmark tests conducted using base models, very little post-training. Like other state-of-the-art SOTA models, Trinity is geared for coding and multi-step processes like agents. Still despite its size, it's not a true soda competitor yet because it currently supports only techs. More models are in the works. A vision model is currently in development and a speech-to-text version is on the roadmap, CTO, Lucas Atkins, Tulled Tech Ranch. In comparison, Metaslamah 4 Maverick is already multi-modal supporting text and images. But before adding more AI models to its roster, Acre says it wanted a base LLM that would impress its main target customers, developers, and academics. The team particularly wants to woo US companies of all sizes away from choosing open models from China. Ultimately, the winners of this game and the only way to really win over the usage is to have the best open-weight model, Acan said. To win the hearts and minds of developers, you have to give them the best. The benchmarks show that the Trinity base model currently in preview, while more post-training takes place, is largely holding its own and in some cases slightly besting LLM on tests of coding and math, common sense, knowledge, and reasoning. The progress Acre has made so far to become a competitive AI lab is impressive. The large Trinity model follows two previous small models released in December, the 26b parameter, Trinity Mini, a fully post-trained reasoning model for task-ranging from web apps to agents, and the 6b parameter Trinity Nano, an experimental model designed to push the boundaries of models that are tiny, yet chatty. The kicker is Acre trained them all in six months for $20 million in total using 2048 Nvidia Blackwell B300 GPUs. This out of the roughly $50 million the company has raised so far, said Founder and CEO Mark McQuade. That kind of cash was a lot for us, says Acans, who led the model-building effort. Still, he acknowledged that it pales in comparison to how much bigger labs are spending right now. Finally, today some news about Claudebot. First, it's no longer called Claudebot, and Thrapix Lawyers finally came calling, I guess, so now it is officially Moltbot. But second, security researchers have a warning for all of you out there tinkering with this thing. They caution that Moltbot requires a specialist skill set to use safely, as data exposure risks persist even when it is set up correctly. Quoting the register, would you be comfortable handing the keys to your identity kingdom over to a bot one that might be exposed to the open internet? Claudebot, now known as Moltbot, has gone viral in AI and developer circles in recent days with fans hailing the open source AI personal assistant as a potential breakthrough. The long and short of it is that Moltbot can be controlled using messaging apps like WhatsApp and Telegram in a similar way to the Gen AI chatbots everyone knows about. Taking things a little further, it's agentic capabilities allow it to take care of life admin for users, such as responding to emails, managing calendars, screening phone calls, or booking table reservations, all with minimal intervention or prompting from the user. All that functionality comes at a cost, however, and not just the outlay so many seem to be making on Mac mini purchases for the sole purpose of hosting a Moltbot instance. In order for Moltbot to read and respond to emails and all of the rest of it, it needs access to accounts and their credentials. Users are handing over the keys to their encrypted messenger apps, phone numbers, and bank accounts to this agentic system. Naturally, security experts have had a few things to say about that. First, there was the furor around public exposures. Moltbot is a complex system, and despite being as easy to install as a typical app on the face of it, the misconfigurations associated with it prompted experts to highlight the dangers of running Moltbot instances without the proper know-how. Jamison O'Reilly, founder of Reddit teaming company, Dvalne was among the first to draw attention to the issue, saying that he saw hundreds of clawbot instances exposed to the web potentially leaking secrets. He told the register that the attack model he reported to Moltbot's developers, which involved proxy misconfigurations and local host connection auto-authentication, is now fixed. However, if exploited, it could have allowed attackers to access months of private messages, account credentials, API keys, and more, anything to which clawbot owners gave it access. According to his showdown scans, supported by others looking into the matter, he found hundreds of instances exposed to the web. If those had open ports allowing authenticated admin connections, it would allow attackers to access the full breadth of secrets in Moltbot. Eric Schwacke, director of cybersecurity strategy at Sultz Security told the register, a significant gap exists between the consumer enthusiasm for clawbots one click appeal and the technical expertise needed to operate a secure agentic gateway. While installing it may resemble a typical Mac app, proper configuration requires a thorough understanding of API posture governance to prevent credential exposure due to misconfigurations or weak authentication. Many users unintentionally create a large visibility void by failing to track which corporate and personal tokens they've shared with the system, without enterprise level insight into these hidden connections. Even a small mistake in a pro-sumer setup can turn a useful tool into an open back door risking exposure of both home and work data to attackers. The security concerns surrounding Moltbot persist even when it is setup correctly as the team at Hudson Rock pointed out this week. This researcher said they looked at Moltbot's code and found that some of the secrets shared with the assistant by users were stored in plain text markdown and JSON files on the user's local file system. The implication there is that if a host machine such as one of the Mac minis being bought on Masterhost Moltbot were infected with info-stealer malware, then it would mean the secret stored by the AI assistant could be compromised. Hudson Rock is already seeing malware as a service families implement capabilities to target local first directory substructures such as those used by Moltbot including Redline, Luma and Vidar. It is fathomable that any of these popular strains of malware could be deployed against the internet exposed Moltbot instances to steal credentials and carry out financially motivated attacks. If the attacker is also able to gain right access, then they can turn Moltbot into a back door, instructing it to safe and sensitive data in the future, trust malicious sources, and more. Moltbot represents the future of personal AI, but its security posture relies on an outdated model of endpoint trust, said Hudson Rock. Without encryption at rest or containerization, the local first AI revolution risks becoming a gold mine for the global cybercrime economy. Nothing more for you today. Talk to you tomorrow.",
      "tags": [
        "earnings",
        "AI",
        "cloud",
        "robotics",
        "security"
      ],
      "companies": [
        {
          "ticker": "META",
          "name": "Meta",
          "note": "財報佳，AI CapEx 將達 $1150-1350 億"
        },
        {
          "ticker": "MSFT",
          "name": "Microsoft",
          "note": "股價跌 12%，Azure 雲端成長放緩至 39%"
        },
        {
          "ticker": "TSLA",
          "name": "Tesla",
          "note": "停產 Model S/X，轉型 Optimus 機器人工廠"
        },
        {
          "ticker": "NVDA",
          "name": "NVIDIA",
          "note": "GPU 需求持續，Acre AI 用 B300 訓練模型"
        },
        {
          "ticker": null,
          "name": "SK Hynix",
          "note": "首次超越 Samsung，年營業利潤 $330 億"
        },
        {
          "ticker": null,
          "name": "Samsung",
          "note": "記憶體晶片，年營業利潤 $305 億"
        },
        {
          "ticker": null,
          "name": "xAI",
          "note": "Musk AI 公司，Tesla 和 SpaceX 各投資 $20 億"
        },
        {
          "ticker": null,
          "name": "SpaceX",
          "note": "投資 xAI $20 億"
        },
        {
          "ticker": "DOW",
          "name": "Dow",
          "note": "AI 裁員 4,500 人，Transform to Outperform 計畫"
        },
        {
          "ticker": null,
          "name": "Waymo",
          "note": "自駕車撞到兒童事故，NHTSA 調查中"
        },
        {
          "ticker": null,
          "name": "BYD",
          "note": "中國低價電動車競爭對手"
        },
        {
          "ticker": "GOOGL",
          "name": "Google",
          "note": "AI agent 電商平台"
        },
        {
          "ticker": null,
          "name": "OpenAI",
          "note": "Microsoft 雲端合約 45%，AI agent 平台"
        },
        {
          "ticker": null,
          "name": "Anthropic",
          "note": "AI 模型公司"
        },
        {
          "ticker": null,
          "name": "Acre AI",
          "note": "美國新創，發布 400B 參數 Trinity 模型"
        },
        {
          "ticker": "UBER",
          "name": "Uber",
          "note": "AI agent 電商合作夥伴"
        },
        {
          "ticker": null,
          "name": "Stripe",
          "note": "AI agent 電商合作夥伴"
        },
        {
          "ticker": "RBRK",
          "name": "Rubrik",
          "note": "贊助商，AI Agent Cloud 平台"
        },
        {
          "ticker": null,
          "name": "PLAUD",
          "note": "贊助商，AI 筆記設備"
        },
        {
          "ticker": null,
          "name": "Hudson Rock",
          "note": "資安公司，發現 Moltbot 安全漏洞"
        }
      ]
    }
  ]
}